<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with LaTeX2HTML 2002-2-1 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Le menu Aide</TITLE>
<META NAME="description" CONTENT="Le menu Aide">
<META NAME="keywords" CONTENT="cascmd_fr">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002-2-1">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="cascmd_fr.css">

<LINK REL="next" HREF="node26.html">
<LINK REL="previous" HREF="node24.html">
<LINK REL="up" HREF="node21.html">
<LINK REL="next" HREF="node26.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html2666"
  HREF="node26.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html2660"
  HREF="node21.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html2654"
  HREF="node24.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html2662"
  HREF="node2.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html2664"
  HREF="node1.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<B> suivant:</B> <A NAME="tex2html2667"
  HREF="node26.html">Les menus des commandes</A>
<B> monter:</B> <A NAME="tex2html2661"
  HREF="node21.html">Les menus</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html2655"
  HREF="node24.html">Le menu Cfg</A>
 &nbsp; <B>  <A NAME="tex2html2663"
  HREF="node2.html">Table des mati&#232;res</A></B> 
 &nbsp; <B>  <A NAME="tex2html2665"
  HREF="node1.html">Index</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H2><A NAME="SECTION00444000000000000000"></A><A NAME="sec:Index"></A>
<BR>
Le menu <TT>Aide</TT>
</H2>
Ce menu contient les diff&#233;rentes formes d'aide possible. 

<UL>
<LI><TT>Index</TT>
Lorsque l'on s&#233;lectionne <TT>Index</TT>, cela ouvre un &#233;cran avec plusieurs
plages donnant pour toutes les commandes, une aide succincte, les commandes 
proches, des exemples .
<BR>
Les diff&#233;rentes plages :
<BR>
Vous voyez sur la plage en haut et &#224; gauche
toutes les commandes utilisables class&#233;es par ordre alphab&#233;tique avec en 
dessous une ligne d'entr&#233;e qui permet de consulter cette liste facilement : 
il suffit de taper le d&#233;but d'un nom dans cette ligne pour avoir le 
curseur &#224; cet endroit dans la liste, vous pouvez ainsi aller directement
&#224; une lettre ou &#224; une commande.
<BR>
En cliquant sur l'une de ces commandes, vous avez :

<UL>
<LI>&#224; droite les commandes proches de la commande mise en surbrillance, 
</LI>
<LI>en dessous la ligne d'entr&#233;e 
</LI>
<LI>en dessous de la ligne d'entr&#233;e, une aide succincte qui 
s'affiche aussi dans le bandeau g&#233;n&#233;ral &#224; l'endroit des messages et une
aide plus compl&#232;te s'affichera, soit dans Mozilla sous Linux, soit dans un 
&#233;cran &#224; part. Sous Linux, il est commode d'ouvrir Mozilla et de 
l'ic&#244;nifier pour pouvoir ouvrir cette aide si cela est necessaire. 
</LI>
<LI>des exemples que l'on peut copier pour les ex&#233;cuter : il suffit d'avoir
le curseur dans une ligne ce commande, puis de cliquer sur l'un des exemples 
pour que cet exemple soit recopi&#233; dans la ligne o&#249; se trouve le curseur.
</LI>
</UL>
Il faut savoir aussi qu'en tapant le d&#233;but d'une commande dans une ligne de 
commandes, puis sur la touche de tabulation, on obtient toutes les commandes de
l'<TT>Index</TT> commen&#231;ant par ce d&#233;but : vous pouvez alors cliquer sur 
l'un des exemples de la commande mise en surbrillance
pour que ce d&#233;but de commande soit compl&#233;t&#233; par cet exemple.
Vous pouvez aussi taper <TT>?nom_de_commande</TT> pour avoir comme r&#233;ponse 
l'aide succincte sur cette commande et &#233;ventuellement taper 
<TT>?nom_de_commande</TT>
suivi de <TT>,</TT> (virgule) <TT>1</TT> ou <TT>2</TT> ou <TT>3</TT> pour indiquer le 
langage utilis&#233; (<TT>1</TT> fran&#231;ais, <TT>2</TT> anglais, <TT>3</TT> espagnol)
dans la r&#233;ponse : par exemple <TT>?factor,2</TT> pour avoir comme r&#233;ponse 
l'aide de <TT>factor</TT> en anglais.
<BR>
<P>
<B>Remarque</B> Quand on choisit les commandes &#224; partir des menus, une aide 
succincte sur cette commande s'affiche dans la ligne des messages (cliquez sur 
<TT>msg</TT> du bandeau) et le manuel de Calcul formel s'ouvre &#224; la bonne page !
<BR>
Quand on choisit les commandes  &#224; partir du bandeau, seule
une aide succincte sur cette commande
s'affiche dans la ligne des messages (cliquez sur <TT>msg</TT> du bandeau). 
</LI>
<LI><TT>Trouve</TT>
recherche le mot demand&#233; dans toutes les pages du manuel Calcul formel.
</LI>
<LI><TT>Interface</TT>
contient de l'aide concernant l'interface de <TT>Xcas</TT>.
</LI>
<LI><TT>Manuels</TT>

<OL>
<LI><TT>Calcul formel</TT>
contient l'aide g&#233;n&#233;rale qui concerne toutes les fonctions de calcul 
formel, de g&#233;om&#233;trie, de statistiques mais qui ne concerne pas les 
instructions de programmation, ni les instructions d&#233;pla&#231;ant la tortue.
</LI>
<LI><TT>Geometrie</TT>
contient une aide plus d&#233;taill&#233;e pour certaines commandes car cette aide 
est illustr&#233;e par des exercices (mais on n'a pas toutes les fonctions de 
g&#233;om&#233;trie !). 
</LI>
<LI><TT>Programmation</TT>
contient une aide d&#233;taill&#233;e des instructions de programmation.
Dans cette partie vous trouverez l'&#233;criture de plusieurs algorithmes avec
la traduction de ces algorithmes en langage <TT>xcas MapleV MuPAD TI89/92</TT>.
</LI>
<LI><TT>Tableur,statistiques</TT>
contient une aide d&#233;taill&#233;e concernant le tableur et les fonctions de 
statistiques ainsi que leurs utilisations dans le tableur.
</LI>
<LI><TT>Tortue</TT>
contient l'aide concernant les instructions qui sont utilis&#233;es dans 
l'&#233;cran de <TT>dessin Tortue</TT>.
Dans cette partie vous trouverez plusieurs activit&#233;s que l'on peut faire 
avec des enfants (du CP au CM2) dans le but de leur faire faire des
math&#233;matiques. 
</LI>
</OL>
</LI>
<LI><TT>Internet</TT>

<OL>
<LI><TT>Forum</TT> permet d'acc&#233;der &#224; un forum de discussion.
</LI>
<LI><TT>Ressources pedagogiques</TT>
contient des exercices sur diff&#233;rents sujets et de diff&#233;rents niveaux.
</LI>
<LI><TT>Mettre a jour l'aide</TT>
permet de mettre l'aide &#224; jour.
</LI>
</OL>
</LI>
<LI><TT>D&#233;buter  en calcul formel</TT>

<OL>
<LI><TT>Tutoriel</TT> est un tutoriel. Il permet de faciliter la 
prise en main de <TT>Xcas</TT> pour faire du calcul formel.
</LI>
<LI><TT>solutions</TT> contient les solutions des exercices du tutoriel. 
</LI>
</OL>

<P>
</LI>
<LI><TT>Recreer les fichiers index de l'aide</TT>
<BR>
Le bouton <TT>Details</TT> de la fen&#234;tre d'index de l'aide ouvre le navigateur
sur la page principale d'aide de la commande en cours si elle
existe. Pour cela il utilise un fichier cache contenant les
correspondances, mais il arrive que ce fichier cache ne soit pas
&#224; jour, ce menu permet de mettre &#224; jour ce fichier cache (il faut
bien sur avoir les droits d'&#233;criture sur le fichier cache).
</LI>
<LI><TT>Exemples</TT>
Si vous s&#233;lectionnez par exemple l'exemple de nom <TT>glace.xws</TT> du sous 
menu <TT>climat</TT>, alors, 
ce fichier sera recopi&#233; du r&#233;pertoire :
<BR><TT>/usr/local/share/giac/examples/Exemples/climat/</TT>
<BR>
dans votre r&#233;pertoire courant et <TT>Xcas</TT> vous ouvrira 
une nouvelle session <TT>glace.xws</TT> qui contiendra ce fichier. Toutefois si 
un fichier dum&#234;me nom existe, on vous demandera auparavant si vous voulez
le remplacer puis l'ouvrir ou bien ouvrir celui du r&#233;pertoire courant sans 
l'&#233;craser.
</LI>
</UL>
<B>Remarques</B> 

<UL>
<LI>Quand on choisit les commandes &#224; partir des menus,
 une aide succincte sur cette commande
s'affiche dans la fen&#234;tre des messages (cliquez sur le bouton <TT>Msg</TT>) et 
par d&#233;faut, le manuel de Calcul formel s'ouvre &#224; la bonne page
</LI>
<LI>On peut activer ou d&#233;sactiver ce m&#233;canisme d'aide
automatique dans le menu <TT>Cfg</TT>, <TT>Configuration generale</TT>,
<TT>Aide HTML automatique</TT>.
</LI>
<LI>Quand on choisit les commandes  &#224; partir du bandeau, seule
une aide succincte sur cette commande s'affiche dans la fen&#234;tre des messages 
(cliquez sur la touche <TT>msg</TT> du bouton <TT>Kbd</TT> ou avec le menu 
<TT>Edit<!-- MATH
 $\blacktriangleright$
 -->
<IMG
 WIDTH="18" HEIGHT="32" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$ \blacktriangleright$">Montrer<!-- MATH
 $\blacktriangleright$
 -->
<IMG
 WIDTH="18" HEIGHT="32" ALIGN="MIDDLE" BORDER="0"
 SRC="img1.png"
 ALT="$ \blacktriangleright$">Msg</TT>). 
</LI>
</UL>

<P>
<HR>
<!--Navigation Panel-->
<A NAME="tex2html2666"
  HREF="node26.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html2660"
  HREF="node21.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html2654"
  HREF="node24.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html2662"
  HREF="node2.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html2664"
  HREF="node1.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<B> suivant:</B> <A NAME="tex2html2667"
  HREF="node26.html">Les menus des commandes</A>
<B> monter:</B> <A NAME="tex2html2661"
  HREF="node21.html">Les menus</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html2655"
  HREF="node24.html">Le menu Cfg</A>
 &nbsp; <B>  <A NAME="tex2html2663"
  HREF="node2.html">Table des mati&#232;res</A></B> 
 &nbsp; <B>  <A NAME="tex2html2665"
  HREF="node1.html">Index</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Documentation de <A HREF="http://www-fourier.ujf-grenoble.fr/~parisse/giac_fr.html">giac</A> &eacute;crite par Ren&eacute;e De Graeve
</ADDRESS>
</BODY>
</HTML>
