<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with LaTeX2HTML 2002-2-1 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Le menu Cfg</TITLE>
<META NAME="description" CONTENT="Le menu Cfg">
<META NAME="keywords" CONTENT="casinter">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002-2-1">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="casinter.css">

<LINK REL="next" HREF="node15.html">
<LINK REL="previous" HREF="node13.html">
<LINK REL="up" HREF="node11.html">
<LINK REL="next" HREF="node15.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html370"
  HREF="node15.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html364"
  HREF="node11.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html358"
  HREF="node13.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html366"
  HREF="node2.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html368"
  HREF="node1.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<B> suivant:</B> <A NAME="tex2html371"
  HREF="node15.html">Le menu Aide</A>
<B> monter:</B> <A NAME="tex2html365"
  HREF="node11.html">La barre du menu</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html359"
  HREF="node13.html">Le menu Edit</A>
 &nbsp; <B>  <A NAME="tex2html367"
  HREF="node2.html">Table des mati&#232;res</A></B> 
 &nbsp; <B>  <A NAME="tex2html369"
  HREF="node1.html">Index</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H2><A NAME="SECTION00063000000000000000"></A><A NAME="351"></A>
<BR>
Le menu <TT>Cfg</TT>
</H2>

<UL>
<LI><TT>Configuration du CAS</TT> permet de configurer le calcul formel (idem que le 
bouton "ligne d'&#233;tat"  situ&#233; entre <TT>Save</TT> et <TT>Stop</TT>,
</LI>
<LI><TT>Configuration graphique</TT> permet de configurer le graphique par d&#233;faut&nbsp;: 
vous pouvez aussi avoir une configuration sp&#233;cifique pour chaque graphique 
avec le bouton <TT>cfg</TT> du graphique, mais cela ne changera pas la 
configuration par d&#233;faut,
</LI>
<LI><TT>Configuration generale</TT> permet de d&#233;terminer la taille des caract&#232;res,
le navigateur, si on veut une aide automatique ou pas, le format de 
l'impression et de cocher ou pas <TT>Paysage</TT> (si cette case est coch&#233;e 
l'impression se fera selon la largeur de la feuille, si elle n'est pas coch&#233;e
l'impression se fera selon la hauteur de la feuille), le nombre de lignes et
de colonnes du tableur, et aussi le nombre d'appels r&#233;cursifs autoris&#233;s, 
</LI>
<LI><TT>Mode (syntax)</TT> permet de travailler avec une syntaxe de type <TT>C</TT>
(Xcas), Maple, TI, Mupad ou Tortue,
</LI>
<LI><TT>Montrer</TT> puis 

<UL>
<LI><TT>DispG</TT> pour voir l'&#233;cran <TT>DispG</TT> sur lequel est 
enregistr&#233; toutes les commandes graphiques
depuis le d&#233;but de la session, sans distinction de niveau. Il
permet en particulier de visualiser les affichages graphiques
interm&#233;diaires d'un programme (en effet seuls les objets graphiques
renvoy&#233;s par <TT>return</TT> peuvent &#234;tre affich&#233;s en
r&#233;ponse dans un niveau o&#249; on ex&#233;cute un programme).
</LI>
<LI><TT>clavier</TT> pour avoir un clavier scientifique. Ce clavier se met 
en bas de la fen&#234;tre.
</LI>
<LI><TT>bandeau</TT> pour avoir les commandes de <TT>Xcas</TT> dans un 
bandeau. Ce bandeau est une ligne de boutons qui se met juste apr&#232;s le 
clavier. Les noms &#233;crits  en rouge sont les noms des menus et les noms 
&#233;crits en noir  sont les noms des commandes.
Il permet d'afficher un sous-menu de mani&#232;re persistante.
Le bandeau est form&#233; d'une ligne qui permet d'avoir facilement &#224; sa 
disposition les commandes qui se trouvent dans les diff&#233;rents menus de la 
barre de menu. 
On appuie par exemple sur <TT>Geo</TT> puis sur <TT>Triangles</TT> pour avoir dans 
le bandeau les commandes g&#233;om&#233;triques de <TT>Xcas</TT> dessinant des 
triangles. 
<BR>
Dans le bandeau on voit :

<UL>
<LI>La touche <TT>home</TT>. Elle permet de revenir au bandeau initial contenant
les menus <TT>Expression, Geo, ,Prg,..</TT>
</LI>
<LI>Les menus ou les sous-menus. Au d&#233;but on a 
<TT>Expression, Geo, ,Prg, Graphe.. </TT>. Puis lorsqu'on affiche les sous-menus, 
on remarquera que cette ligne se  termine par la touche <TT>BACK</TT> qui permet 
de revenir au bandeau pr&#233;c&#233;dent.
</LI>
<LI>Les touches <TT>&#187;</TT> et <TT>&#171;</TT> . Elles permettent de circuler dans la 
ligne du bandeau.
</LI>
<LI>La touche <TT>cust</TT> <A NAME="sec:cust"></A> (pour custom). Elle permet de  
mettre les  noms de ses propres commandes dans un menu d&#233;fini dans 
la variable <TT>CST</TT>, <TT>CST</TT> doit contenir une liste qui sera le menu 
affich&#233;.
<BR>
Par exemple <TT>CST:=[1,2,3]</TT> va afficher comme menu <TT>1, 2, 3</TT>.
On pourra donc faire un bandeau personnalis&#233; en  mettant dans <TT>CST</TT> les 
noms des fonctions que l'on veut utiliser ou les noms des fonctions que 
l'on a cr&#233;&#233;es.
<BR>
Par exemple, on d&#233;finit la fonction <TT>f(x):=x<code>^</code>2+2*x+3</TT> et on 
tape :
<BR><TT>CST:=[evalc,["f",f],["euro",6.55957]]</TT> 
<BR>
On obtient quand on appuie sur <TT>cust</TT>, un bandeau qui contient comme 
menu :
<BR><TT>evalc f euro</TT>.
<BR>
puis, on d&#233;finit la fonction <TT>f(x):=x<code>^</code>2+2*x+3</TT> et on peut ainsi 
appeler <TT>f</TT> depuis <TT>eqw</TT> :
<BR>
on met par exemple 3 dans <TT>eqw</TT> puis on appuie sur <TT>f</TT> et on obtient 
18.
On peut ainsi appeler <TT>evalc()</TT> dans une ligne d'entr&#233;e en appuyant sur 
<TT>evalc</TT>
ou encore on utilise la touche <TT>euro</TT> dans un calcul.
 
</LI>
</UL>
</LI>
<LI><TT>msg</TT> pour avoir la fen&#234;tre des messages. La fen&#234;tre des 
messages se met juste apr&#232;s le bandeau.
</LI>
</UL>
</LI>
<LI><TT>Cacher</TT> puis 

<UL>
<LI><TT>DispG</TT> pour ne plus voir l'&#233;cran <TT>DispG</TT> sur lequel est 
enregistr&#233;, depuis le d&#233;but de la session, toutes les commandes graphiques,
</LI>
<LI><TT>clavier</TT> pour ne plus voir le clavier scientifique, 
</LI>
<LI><TT>bandeau</TT> pour ne plus voir les commandes de <TT>Xcas</TT> dans 
le bandeau,
</LI>
<LI><TT>msg</TT> pour ne plus voir la fen&#234;tre des messages,
</LI>
</UL>
</LI>
<LI><TT>Langue de l'aide</TT> pour choisir d'avoir l'aide en fran&#231;ais, 
en anglais ou en espagnol,
</LI>
<LI><TT>Couleurs</TT> pour choisir la couleur de l'affichage selon son type, 
</LI>
<LI><TT>Police session</TT> permet de changer la police et la taille des 
caract&#232;res de la session en choisissant la police et la taille de la fonte 
(par d&#233;faut police helvetica de taille 20),
</LI>
<LI><TT>Polices (toutes)</TT> permet de changer la police et la taille des 
caract&#232;res  de la session, du menu principal et du  clavier en choisissant la
police et la taille de la fonte (par d&#233;faut police helvetica de taille 20)
</LI>
<LI><TT>Navigateur</TT> permet de donner le nom de votre navigateur,
</LI>
<LI><TT>Sauver pr&#233;f&#233;rences</TT> permet de sauver les diff&#233;rentes 
configurations choisies avec le menu <TT>Cfg</TT> ou avec le bouton donnant la
ligne d'&#233;tat et ainsi de les retrouver pour des utilisations ult&#233;rieures.
</LI>
</UL>

<P>
<HR>
<!--Navigation Panel-->
<A NAME="tex2html370"
  HREF="node15.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html364"
  HREF="node11.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html358"
  HREF="node13.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html366"
  HREF="node2.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A> 
<A NAME="tex2html368"
  HREF="node1.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index" SRC="index.png"></A> 
<BR>
<B> suivant:</B> <A NAME="tex2html371"
  HREF="node15.html">Le menu Aide</A>
<B> monter:</B> <A NAME="tex2html365"
  HREF="node11.html">La barre du menu</A>
<B> pr&eacute;c&eacute;dent:</B> <A NAME="tex2html359"
  HREF="node13.html">Le menu Edit</A>
 &nbsp; <B>  <A NAME="tex2html367"
  HREF="node2.html">Table des mati&#232;res</A></B> 
 &nbsp; <B>  <A NAME="tex2html369"
  HREF="node1.html">Index</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Documentation de <A HREF="http://www-fourier.ujf-grenoble.fr/~parisse/giac_fr.html">giac</A> &eacute;crite par Ren&eacute;e De Graeve
</ADDRESS>
</BODY>
</HTML>
